Readme.org
* Roadmap

** get a working name

** Multilanguage support PT/EN
*** DONE basic solution

** Data parsing
   parse a json file into the directory structure

** DONE load 2014 data with addresses on the cgi/clj script
** TODO create bb task that parses the json and spits schools
** TODO places list needs a display tag for municipio/district/etc
** TODO Massage municipality of schools

** places autocomplete

   places list gets loaded in the frontend and is used for autocomplete. No need to fetch the server

*** DONE edn file with names
*** DONE list of places
*** DONE lib that gets sugestions main/query-place-list
*** DONE place-match functionality  in frontend
*** TODO frontend page
**** DONE basic autocomplete flow
**** TODO icons/styling
**** DONE generate links from k

** routing

** main page

** TODO listing page
*** DONE load listing data
    :LOGBOOK:
    CLOCK: [2022-04-05 Tue 15:59]--[2022-04-05 Tue 16:35] =>  0:36
    :END:

*** TODO Display basic map
*** TODO display listing

** school page ?

** Technical/setup stuff

  - [X] how to require namespaces
  - [X] private github account
  - [X] cider repl with babashka setup
  - [X] slurp pdf

  - [X] shadow-clj build for frontend
  - [X] Workspaces build
  - [X] browser hot reload
  - +Address search box+
  - https://www.geoapify.com/pricing
  - https://leafletjs.com/SlavaUkraini/examples.html

  - [X] css pipeline
    - [X] basic less pipeline
    - [X] file watcher
    - +babashka file watcher+

** +Access if nominatim is valid and host it+


* Nominatim

https://github.com/mediagis/nominatim-docker/tree/master/4.0

docker run -it --rm -d \
  -e PBF_URL=https://download.geofabrik.de/europe/portugal-latest.osm.pbf \
  -e REPLICATION_URL=https://download.geofabrik.de/europe/portugal-updates/ \
  -p 8080:8080 \
  --name nominatim \
  mediagis/nominatim:4.0

http://localhost:8080/search.php?q=rua%20vale%20formoso
Docs: https://nominatim.org/release-docs/latest/api/Search/

* Util

** logs

docker exec -it clj_cgi_web_1 tail -f -n 20 /var/log/apache2/error.log

** babashka nrepl

local$ bb nrepl

then cider connect

* API

** Names endpoint

json endpoint that returns name sugestions and lat/long and others.

/names?q=rua+vale+formoso+lisboa

** less

lessc .src/less/main.less target/main.css

or

npx less-watch-compiler src/less/ target/css/

** hot reload by live.js
