Readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-05 Tue 16:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Flavio Sousa" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8181327">1. Roadmap</a>
<ul>
<li><a href="#org83583a7">1.1. get a working name</a></li>
<li><a href="#orgecbd5d2">1.2. Multilanguage support PT/EN</a>
<ul>
<li><a href="#orgcd57723">1.2.1. <span class="done DONE">DONE</span> basic solution</a></li>
</ul>
</li>
<li><a href="#orgbcf06ff">1.3. Data parsing</a></li>
<li><a href="#orgdfea6fd">1.4. <span class="done DONE">DONE</span> load 2014 data with addresses on the cgi/clj script</a></li>
<li><a href="#org27e950c">1.5. <span class="todo TODO">TODO</span> create bb task that parses the json and spits schools</a></li>
<li><a href="#orgf45e9ce">1.6. <span class="todo TODO">TODO</span> places list needs a display tag for municipio/district/etc</a></li>
<li><a href="#orgde60f52">1.7. <span class="todo TODO">TODO</span> Massage municipality of schools</a></li>
<li><a href="#org28d091d">1.8. places autocomplete</a>
<ul>
<li><a href="#org4694f1b">1.8.1. <span class="done DONE">DONE</span> edn file with names</a></li>
<li><a href="#org15b3ec9">1.8.2. <span class="done DONE">DONE</span> list of places</a></li>
<li><a href="#org1c6e85a">1.8.3. <span class="done DONE">DONE</span> lib that gets sugestions main/query-place-list</a></li>
<li><a href="#org0a40583">1.8.4. <span class="done DONE">DONE</span> place-match functionality  in frontend</a></li>
<li><a href="#orgacfd71e">1.8.5. <span class="todo TODO">TODO</span> frontend page</a></li>
</ul>
</li>
<li><a href="#orgbf4b357">1.9. routing</a></li>
<li><a href="#orgdda6c97">1.10. main page</a></li>
<li><a href="#org24680dd">1.11. <span class="todo TODO">TODO</span> listing page</a>
<ul>
<li><a href="#org44a7d39">1.11.1. <span class="done DONE">DONE</span> load listing data</a></li>
<li><a href="#org745d27b">1.11.2. <span class="todo TODO">TODO</span> Display basic map</a></li>
<li><a href="#org282351d">1.11.3. <span class="todo TODO">TODO</span> display listing</a></li>
</ul>
</li>
<li><a href="#org7d4860d">1.12. school page ?</a></li>
<li><a href="#org832144a">1.13. Technical/setup stuff</a></li>
<li><a href="#orge1180a1">1.14. <del>Access if nominatim is valid and host it</del></a></li>
</ul>
</li>
<li><a href="#org042ce5f">2. Nominatim</a></li>
<li><a href="#orgd526891">3. Util</a>
<ul>
<li><a href="#org7d09fc6">3.1. logs</a></li>
<li><a href="#org5ae3d69">3.2. babashka nrepl</a></li>
</ul>
</li>
<li><a href="#orgee72e49">4. API</a>
<ul>
<li><a href="#orga0f0b86">4.1. Names endpoint</a></li>
<li><a href="#orgc99c985">4.2. less</a></li>
<li><a href="#org43a0f7f">4.3. hot reload by live.js</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org8181327" class="outline-2">
<h2 id="org8181327"><span class="section-number-2">1</span> Roadmap</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org83583a7" class="outline-3">
<h3 id="org83583a7"><span class="section-number-3">1.1</span> get a working name</h3>
</div>

<div id="outline-container-orgecbd5d2" class="outline-3">
<h3 id="orgecbd5d2"><span class="section-number-3">1.2</span> Multilanguage support PT/EN</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgcd57723" class="outline-4">
<h4 id="orgcd57723"><span class="section-number-4">1.2.1</span> <span class="done DONE">DONE</span> basic solution</h4>
</div>
</div>

<div id="outline-container-orgbcf06ff" class="outline-3">
<h3 id="orgbcf06ff"><span class="section-number-3">1.3</span> Data parsing</h3>
<div class="outline-text-3" id="text-1-3">
<p>
parse a json file into the directory structure
</p>
</div>
</div>

<div id="outline-container-orgdfea6fd" class="outline-3">
<h3 id="orgdfea6fd"><span class="section-number-3">1.4</span> <span class="done DONE">DONE</span> load 2014 data with addresses on the cgi/clj script</h3>
</div>
<div id="outline-container-org27e950c" class="outline-3">
<h3 id="org27e950c"><span class="section-number-3">1.5</span> <span class="todo TODO">TODO</span> create bb task that parses the json and spits schools</h3>
</div>
<div id="outline-container-orgf45e9ce" class="outline-3">
<h3 id="orgf45e9ce"><span class="section-number-3">1.6</span> <span class="todo TODO">TODO</span> places list needs a display tag for municipio/district/etc</h3>
</div>
<div id="outline-container-orgde60f52" class="outline-3">
<h3 id="orgde60f52"><span class="section-number-3">1.7</span> <span class="todo TODO">TODO</span> Massage municipality of schools</h3>
</div>

<div id="outline-container-org28d091d" class="outline-3">
<h3 id="org28d091d"><span class="section-number-3">1.8</span> places autocomplete</h3>
<div class="outline-text-3" id="text-1-8">
<p>
places list gets loaded in the frontend and is used for autocomplete. No need to fetch the server
</p>
</div>

<div id="outline-container-org4694f1b" class="outline-4">
<h4 id="org4694f1b"><span class="section-number-4">1.8.1</span> <span class="done DONE">DONE</span> edn file with names</h4>
</div>
<div id="outline-container-org15b3ec9" class="outline-4">
<h4 id="org15b3ec9"><span class="section-number-4">1.8.2</span> <span class="done DONE">DONE</span> list of places</h4>
</div>
<div id="outline-container-org1c6e85a" class="outline-4">
<h4 id="org1c6e85a"><span class="section-number-4">1.8.3</span> <span class="done DONE">DONE</span> lib that gets sugestions main/query-place-list</h4>
</div>
<div id="outline-container-org0a40583" class="outline-4">
<h4 id="org0a40583"><span class="section-number-4">1.8.4</span> <span class="done DONE">DONE</span> place-match functionality  in frontend</h4>
</div>
<div id="outline-container-orgacfd71e" class="outline-4">
<h4 id="orgacfd71e"><span class="section-number-4">1.8.5</span> <span class="todo TODO">TODO</span> frontend page</h4>
<div class="outline-text-4" id="text-1-8-5">
</div>
<ol class="org-ol">
<li><a id="org6f668e7"></a><span class="done DONE">DONE</span> basic autocomplete flow<br /></li>
<li><a id="org988ce79"></a><span class="todo TODO">TODO</span> icons/styling<br /></li>
<li><a id="org7a50bf2"></a><span class="done DONE">DONE</span> generate links from k<br /></li>
</ol>
</div>
</div>

<div id="outline-container-orgbf4b357" class="outline-3">
<h3 id="orgbf4b357"><span class="section-number-3">1.9</span> routing</h3>
</div>

<div id="outline-container-orgdda6c97" class="outline-3">
<h3 id="orgdda6c97"><span class="section-number-3">1.10</span> main page</h3>
</div>

<div id="outline-container-org24680dd" class="outline-3">
<h3 id="org24680dd"><span class="section-number-3">1.11</span> <span class="todo TODO">TODO</span> listing page</h3>
<div class="outline-text-3" id="text-1-11">
</div>
<div id="outline-container-org44a7d39" class="outline-4">
<h4 id="org44a7d39"><span class="section-number-4">1.11.1</span> <span class="done DONE">DONE</span> load listing data</h4>
<div class="outline-text-4" id="text-1-11-1">
</div>
</div>

<div id="outline-container-org745d27b" class="outline-4">
<h4 id="org745d27b"><span class="section-number-4">1.11.2</span> <span class="todo TODO">TODO</span> Display basic map</h4>
</div>
<div id="outline-container-org282351d" class="outline-4">
<h4 id="org282351d"><span class="section-number-4">1.11.3</span> <span class="todo TODO">TODO</span> display listing</h4>
</div>
</div>

<div id="outline-container-org7d4860d" class="outline-3">
<h3 id="org7d4860d"><span class="section-number-3">1.12</span> school page ?</h3>
</div>

<div id="outline-container-org832144a" class="outline-3">
<h3 id="org832144a"><span class="section-number-3">1.13</span> Technical/setup stuff</h3>
<div class="outline-text-3" id="text-1-13">
<ul class="org-ul">
<li class="on"><code>[X]</code> how to require namespaces</li>
<li class="on"><code>[X]</code> private github account</li>
<li class="on"><code>[X]</code> cider repl with babashka setup</li>
<li class="on"><code>[X]</code> slurp pdf</li>

<li class="on"><code>[X]</code> shadow-clj build for frontend</li>
<li class="on"><code>[X]</code> Workspaces build</li>
<li class="on"><code>[X]</code> browser hot reload</li>
<li><del>Address search box</del></li>
<li><a href="https://www.geoapify.com/pricing">https://www.geoapify.com/pricing</a></li>
<li><a href="https://leafletjs.com/SlavaUkraini/examples.html">https://leafletjs.com/SlavaUkraini/examples.html</a></li>

<li class="on"><code>[X]</code> css pipeline
<ul class="org-ul">
<li class="on"><code>[X]</code> basic less pipeline</li>
<li class="on"><code>[X]</code> file watcher</li>
<li><del>babashka file watcher</del></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge1180a1" class="outline-3">
<h3 id="orge1180a1"><span class="section-number-3">1.14</span> <del>Access if nominatim is valid and host it</del></h3>
</div>
</div>


<div id="outline-container-org042ce5f" class="outline-2">
<h2 id="org042ce5f"><span class="section-number-2">2</span> Nominatim</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://github.com/mediagis/nominatim-docker/tree/master/4.0">https://github.com/mediagis/nominatim-docker/tree/master/4.0</a>
</p>

<p>
docker run -it &#x2013;rm -d \
  -e PBF<sub>URL</sub>=<a href="https://download.geofabrik.de/europe/portugal-latest.osm.pbf">https://download.geofabrik.de/europe/portugal-latest.osm.pbf</a> \
  -e REPLICATION<sub>URL</sub>=<a href="https://download.geofabrik.de/europe/portugal-updates/">https://download.geofabrik.de/europe/portugal-updates/</a> \
  -p 8080:8080 \
  &#x2013;name nominatim \
  mediagis/nominatim:4.0
</p>

<p>
<a href="http://localhost:8080/search.php?q=rua%20vale%20formoso">http://localhost:8080/search.php?q=rua%20vale%20formoso</a>
Docs: <a href="https://nominatim.org/release-docs/latest/api/Search/">https://nominatim.org/release-docs/latest/api/Search/</a>
</p>
</div>
</div>

<div id="outline-container-orgd526891" class="outline-2">
<h2 id="orgd526891"><span class="section-number-2">3</span> Util</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org7d09fc6" class="outline-3">
<h3 id="org7d09fc6"><span class="section-number-3">3.1</span> logs</h3>
<div class="outline-text-3" id="text-3-1">
<p>
docker exec -it clj<sub>cgi</sub><sub>web</sub><sub>1</sub> tail -f -n 20 /var/log/apache2/error.log
</p>
</div>
</div>

<div id="outline-container-org5ae3d69" class="outline-3">
<h3 id="org5ae3d69"><span class="section-number-3">3.2</span> babashka nrepl</h3>
<div class="outline-text-3" id="text-3-2">
<p>
local$ bb nrepl
</p>

<p>
then cider connect
</p>
</div>
</div>
</div>

<div id="outline-container-orgee72e49" class="outline-2">
<h2 id="orgee72e49"><span class="section-number-2">4</span> API</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orga0f0b86" class="outline-3">
<h3 id="orga0f0b86"><span class="section-number-3">4.1</span> Names endpoint</h3>
<div class="outline-text-3" id="text-4-1">
<p>
json endpoint that returns name sugestions and lat/long and others.
</p>

<p>
/names?q=rua+vale+formoso+lisboa
</p>
</div>
</div>

<div id="outline-container-orgc99c985" class="outline-3">
<h3 id="orgc99c985"><span class="section-number-3">4.2</span> less</h3>
<div class="outline-text-3" id="text-4-2">
<p>
lessc .src/less/main.less target/main.css
</p>

<p>
or
</p>

<p>
npx less-watch-compiler src/less/ target/css/
</p>
</div>
</div>

<div id="outline-container-org43a0f7f" class="outline-3">
<h3 id="org43a0f7f"><span class="section-number-3">4.3</span> hot reload by live.js</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Flavio Sousa</p>
<p class="date">Created: 2022-04-05 Tue 16:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
